import { Injectable, signal } from '@angular/core';
import { MetricScoreMeaning } from '../shared/models/metric-score-meaning';

@Injectable({
  providedIn: 'root',
})
export class ScoreExplanationService {
  constructor() {}

  zoneRank = signal<{ [key: string]: MetricScoreMeaning }>({
    LL: {
      val: 1,
      topic: 'ศักยภาพและความเต็มใจอยู่ในระดับที่ต้องการการพัฒนา',
      topicEn: '(LOW CAPACITY- LOW WILLINGNESS)',
      description: `แผนในหมวดนี้อาจแสดงให้เห็นถึงโอกาสในการพัฒนาทักษะและการมีส่วนร่วมในกิจกรรมระหว่างประเทศ

แนวทางการพัฒนา ควรสนับสนุนด้านการฝึกอบรมและการสร้างความตระหนักถึงความสำคัญของงานด้านต่างประเทศอาจช่วยยกระดับศักยภาพและความเต็มใจได้
`,
      descriptionWithStyle: `แผนในหมวดนี้อาจแสดงให้เห็นถึงโอกาสในการพัฒนาทักษะและการมีส่วนร่วมในกิจกรรมระหว่างประเทศ

<b>แนวทางการพัฒนา</b>
ควรสนับสนุนด้านการฝึกอบรมและการสร้างความตระหนักถึงความสำคัญของงานด้านต่างประเทศอาจช่วยยกระดับศักยภาพและความเต็มใจได้
`,
    },
    ML: {
      val: 2,
      topic: 'ศักยภาพปานกลาง - ความเต็มใจอยู่ในระดับที่ต้องการการพัฒนา',
      topicEn: '(MEDIUM CAPACITY- LOW WILLINGNESS)',
      description: `แผนมีทักษะและทรัพยากรบางส่วน แต่อาจต้องการการกระตุ้นแรงจูงใจเพิ่มเติม

แนวทางการพัฒนาจึงควรสร้างความเข้าใจถึงคุณค่าของงานด้านต่างประเทศและการปรับบทบาทให้สอดคล้องกับเป้าหมายส่วนบุคคลอาจช่วยเพิ่มความเต็มใจได้
`,
      descriptionWithStyle: `แผนมีทักษะและทรัพยากรบางส่วน แต่อาจต้องการการกระตุ้นแรงจูงใจเพิ่มเติม

<b>แนวทางการพัฒนา</b>จึงควรสร้างความเข้าใจถึงคุณค่าของงานด้านต่างประเทศและการปรับบทบาทให้สอดคล้องกับเป้าหมายส่วนบุคคลอาจช่วยเพิ่มความเต็มใจได้
`,
    },
    LM: {
      val: 3,
      topic: 'ศักยภาพอยู่ในระดับที่ต้องการการพัฒนา-ความเต็มใจปานกลาง',
      topicEn: '(LOW CAPACITY- MEDIUM WILLINGNESS)',
      description: `แผนมีความสนใจในงานด้านต่างประเทศ แต่อาจต้องการการพัฒนาทักษะหรือทรัพยากรเพิ่มเติม

แนวทางการพัฒนาจึงควรจัดหาโอกาสในการพัฒนาทักษะและการสนับสนุนทรัพยากรอย่างเหมาะสมจะช่วยเสริมสร้างศักยภาพให้สอดคล้องกับระดับความเต็มใจ
`,
      descriptionWithStyle: `แผนมีความสนใจในงานด้านต่างประเทศ แต่อาจต้องการการพัฒนาทักษะหรือทรัพยากรเพิ่มเติม

<b>แนวทางการพัฒนา</b>จึงควรจัดหาโอกาสในการพัฒนาทักษะและการสนับสนุนทรัพยากรอย่างเหมาะสมจะช่วยเสริมสร้างศักยภาพให้สอดคล้องกับระดับความเต็มใจ
`,
    },
    HL: {
      val: 4,
      topic: 'ศักยภาพสูง - ความเต็มใจอยู่ในระดับที่ต้องการการพัฒนา',
      topicEn: '(HIGH CAPACITY- LOW WILLINGNESS)',
      description: `แผนมีทักษะและทรัพยากรที่ดี แต่อาจต้องการการกระตุ้นแรงจูงใจเพิ่มเติม

แนวทางการพัฒนาจึงควรปรับกิจกรรมให้สอดคล้องกับเป้าหมายส่วนบุคคลและการสร้างการรับรู้ถึงคุณค่าของงานด้านต่างประเทศซึ่งอาจช่วยเพิ่มความเต็มใจได้
`,
      descriptionWithStyle: `แผนมีทักษะและทรัพยากรที่ดี แต่อาจต้องการการกระตุ้นแรงจูงใจเพิ่มเติม

<b>แนวทางการพัฒนา</b>จึงควรปรับกิจกรรมให้สอดคล้องกับเป้าหมายส่วนบุคคลและการสร้างการรับรู้ถึงคุณค่าของงานด้านต่างประเทศซึ่งอาจช่วยเพิ่มความเต็มใจได้
`,
    },
    LH: {
      val: 5,
      topic: 'ศักยภาพอยู่ในระดับที่ต้องการการพัฒนา-ความเต็มใจสูง',
      topicEn: '(LOW CAPACITY- HIGH WILLINGNESS)',
      description: `แผนมีความกระตือรือร้นสูงในงานด้านต่างประเทศ แต่อาจต้องการการพัฒนาทักษะเพิ่มเติม 

แนวทางการพัฒนาจึงควรเน้นการฝึกอบรมเฉพาะทางและการสนับสนุนการพัฒนาทักษะเพื่อช่วยให้สามารถใช้ประโยชน์จากความเต็มใจที่เป็นอยู่อย่างเต็มที่
`,
      descriptionWithStyle: `แผนมีความกระตือรือร้นสูงในงานด้านต่างประเทศ แต่อาจต้องการการพัฒนาทักษะเพิ่มเติม 

<b>แนวทางการพัฒนา</b>จึงควรเน้นการฝึกอบรมเฉพาะทางและการสนับสนุนการพัฒนาทักษะเพื่อช่วยให้สามารถใช้ประโยชน์จากความเต็มใจที่เป็นอยู่อย่างเต็มที่
`,
    },
    MM: {
      val: 6,
      topic: 'ศักยภาพและความเต็มใจอยู่ในระดับปานกลาง',
      topicEn: '(MEDIUM CAPACITY- MEDIUM WILLINGNESS)',
      description: `แผนมีทักษะและความสนใจในระดับปานกลาง ซึ่งเพียงพอต่อการปฏิบัติงานทั่วไป 

แนวทางการพัฒนาจึงควรควบคู่ทั้งด้านทักษะและการสร้างแรงจูงใจอย่างสมดุลจะช่วยยกระดับประสิทธิภาพโดยรวม
`,
      descriptionWithStyle: `แผนมีทักษะและความสนใจในระดับปานกลาง ซึ่งเพียงพอต่อการปฏิบัติงานทั่วไป 

<b>แนวทางการพัฒนา</b>จึงควรควบคู่ทั้งด้านทักษะและการสร้างแรงจูงใจอย่างสมดุลจะช่วยยกระดับประสิทธิภาพโดยรวม
`,
    },
    HM: {
      val: 7,
      topic: 'ศักยภาพสูง - ความเต็มใจปานกลาง',
      topicEn: '(HIGH CAPACITY- MEDIUM WILLINGNESS)',
      description: `แผนมีความพร้อมด้านทักษะและทรัพยากร พร้อมทั้งมีแรงจูงใจในระดับที่ดี
แนวทางการพัฒนาจึงควรเพิ่มแรงจูงใจและการใช้ประโยชน์จากความสามารถที่มีอยู่อย่างเต็มที่จะนำไปสู่ผลลัพธ์ที่โดดเด่นยิ่งขึ้น
`,
      descriptionWithStyle: `แผนมีความพร้อมด้านทักษะและทรัพยากร พร้อมทั้งมีแรงจูงใจในระดับที่ดี

<b>แนวทางการพัฒนา</b>จึงควรเพิ่มแรงจูงใจและการใช้ประโยชน์จากความสามารถที่มีอยู่อย่างเต็มที่จะนำไปสู่ผลลัพธ์ที่โดดเด่นยิ่งขึ้น
`,
    },
    MH: {
      val: 8,
      topic: 'ศักยภาพปานกลาง - ความเต็มใจสูง',
      topicEn: '(MEDIUM CAPACITY- HIGH WILLINGNESS)',
      description: `แผนมีความกระตือรือร้นสูงและมีทักษะในระดับปานกลาง 
แนวทางการพัฒนาจึงควรเพิ่มเติมทักษะและการจัดสรรทรัพยากรอย่างเหมาะสมจะช่วยให้สามารถใช้ประโยชน์จากความเต็มใจที่มีอยู่ได้อย่างเต็มที่
`,
      descriptionWithStyle: `แผนมีความกระตือรือร้นสูงและมีทักษะในระดับปานกลาง 
      
<b>แนวทางการพัฒนา</b>จึงควรเพิ่มเติมทักษะและการจัดสรรทรัพยากรอย่างเหมาะสมจะช่วยให้สามารถใช้ประโยชน์จากความเต็มใจที่มีอยู่ได้อย่างเต็มที่
`,
    },
    HH: {
      val: 9,
      topic: 'ศักยภาพและความเต็มใจสูง',
      topicEn: '(HIGH CAPACITY- HIGH WILLINGNESS)',
      description: `แผนมีทั้งความสามารถและความกระตือรือร้นในระดับสูงสำหรับกิจกรรมระดับนานาชาติ

ควรส่งเสริมให้เป็นต้นแบบและแบ่งปันประสบการณ์เพื่อสร้างแรงบันดาลใจให้กับแผนอื่นๆ ในองค์กร
`,
      descriptionWithStyle: `แผนมีทั้งความสามารถและความกระตือรือร้นในระดับสูงสำหรับกิจกรรมระดับนานาชาติ

ควรส่งเสริมให้เป็นต้นแบบและแบ่งปันประสบการณ์เพื่อสร้างแรงบันดาลใจให้กับแผนอื่นๆ ในองค์กร
`,
    },
  });

  getScoreRank() {
    return this.zoneRank();
  }
}
